nc: 1 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],                            # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],                              # 1-P2/4
   [-1, 3, C3, [128]],                                      # 2
   [-1, 1, Conv, [256, 3, 2]],                              # 3-P3/8
   [-1, 1, SwinTransformer_Layer, [128,2,8,True,8]],        # 4
   [-1, 1, Conv, [512, 3, 2]],                              # 5-P4/16
   [-1, 1, SwinTransformer_Layer, [256,2,8,True,8]],        # 6
   [-1, 1, Conv, [1024, 3, 2]],                             # 7-P5/32
   [-1, 1, SwinTransformer_Layer, [512,2,8,True,4]],        # 8
   [-1, 1, GAM_Attention, [512,512]],                       # 9
   [-1, 1, SPPF, [1024, 5]],                                # 10
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],                              # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],              # 12
   [[-1, 6], 1, Concat, [1]],                               # 13
   [-1, 3, C3, [512, False]],                               # 14

   [-1, 1, Conv, [256, 1, 1]],                              # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],              # 16
   [[-1, 4], 1, Concat, [1]],                               # 17
   [-1, 3, C3, [256, False]],                               # 18
   [-1, 1,GAM_Attention, [128,128]],                        # 19

   [-1, 1, Conv, [512, 3, 2]],                              # 20
   [[-1, 6, 13], 1, Concat, [1]],                           # 21
   [-1, 3, C3, [512, False]],                               # 22
   [-1, 1, SwinTransformer_Layer, [256,2,2,True,8]],        # 23
   [-1, 1,GAM_Attention, [256,256]],                        # 24

   [-1, 1, Conv, [1024, 3, 2]],                             # 25
   [[-1, 10], 1, Concat, [1]],                              # 26
   [-1, 3, C3, [1024, False]],                              # 27 (P4/16-medium)
   [-1, 1, SwinTransformer_Layer, [512,2,2,True,4]],        # 28
   [-1, 1,GAM_Attention, [512,512]],                        # 29

   [[19, 24, 29], 1,Decoupled_Detect, [nc, anchors]],       # Detect(P3, P4, P5)
  ]

